Autodesk.Revit.DB.Visual.AssetPropertyList.RemoveAssetProperty(System.Int32)
Remove the AssetProperty from the list.
index:
Index to remove the AssetProperty from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.InsertNewAssetPropertyInteger(System.Int32,System.Int32)
Insert a new AssetPropertyInteger containing the input value to this list.
value:
The integer value to insert.
index:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.InsertNewAssetAsColor(Autodesk.Revit.DB.Color,System.Int32)
Insert a new AssetPropertyDouble4 containing the input value to this list.
value:
The color value to insert.
index:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.InsertNewAssetPropertyDouble(System.Double,System.Int32)
Inserts a new AssetPropertyDouble containing the input value to this list.
value:
The double value to insert.
index:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetPropertyInteger(System.Int32)
Adds a new AssetPropertyInteger containing the input value to this list.
value:
The integer value to add.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetAsColor(Autodesk.Revit.DB.Color)
Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color.
value:
The color value to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetPropertyDouble(System.Double)
Adds a new AssetPropertyDouble containing the input value to this list.
value:
The double value to add.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.IsValidValue(System.Collections.Generic.IList{Autodesk.Revit.DB.Visual.AssetProperty})
Check that value is valid.
value:
The array of properties to validate.
Returns:
Returns true if the array of properties is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.SetValue(System.Collections.Generic.IList{Autodesk.Revit.DB.Visual.AssetProperty})
Sets collection of properties stored in this property list.
Remarks:
All the properties in the list are of the same AssetPropertyType.
The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.
value:
An array of properties.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value is invalid for this AssetPropertyList property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2014

Autodesk.Revit.DB.Visual.AssetPropertyList.GetValue
Gets a collection of properties stored in this property list. These properties are copied.
Remarks:
All the properties in the list are of the same AssetPropertyType.
The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.
Returns:
Returns a copy of all the properties in this AssetPropertyList.
Since:
2014

Autodesk.Revit.DB.Visual.AssetPropertyList
Represents a list of AssetProperty(s).
Since:
2014